In [3]:
!pip install pandas as pd

Requirement already satisfied: pandas in c:\users\navyashree\anaconda3\lib\site-packages (2.2.2)

ERROR: Could not find a version that satisfies the requirement as (from versions: none)
ERROR: No matching distribution found for as

In [4]:
import pandas as pd

In [59]:
df = pd.read_csv(r"C:\Users\navyashree\Desktop\MIni DataPipeline\salary.csv")

In [61]:
print("Original Data")

Original Data

In [63]:
print(df)

   employee_id   name   age     salary department        city
0            1   Amit  30.0    45000.0         IT      Mysuru
1            2  Surya  20.0    43000.0         HR   Bangaluru
2            3  Surya  23.0    15000.0         IT  Bhadravati
3            4  Navya   NaN        NaN         HR    Manglore
4            5  Bindu  40.0  1200000.0        NaN       Kopla
5            6  Bindu  40.0    20000.0         EC       Kopla
6            6  Bindu  40.0    20000.0         EC       Kopla

In [65]:
df = df.drop_duplicates()
print("After Removing duplicates")
print(df)

After Removing duplicates
   employee_id   name   age     salary department        city
0            1   Amit  30.0    45000.0         IT      Mysuru
1            2  Surya  20.0    43000.0         HR   Bangaluru
2            3  Surya  23.0    15000.0         IT  Bhadravati
3            4  Navya   NaN        NaN         HR    Manglore
4            5  Bindu  40.0  1200000.0        NaN       Kopla
5            6  Bindu  40.0    20000.0         EC       Kopla

In [67]:
df=df.drop_duplicates(subset=["name", "age", "salary", "department", "city"])

In [69]:
print("After Cleaning")
print(df)

After Cleaning
   employee_id   name   age     salary department        city
0            1   Amit  30.0    45000.0         IT      Mysuru
1            2  Surya  20.0    43000.0         HR   Bangaluru
2            3  Surya  23.0    15000.0         IT  Bhadravati
3            4  Navya   NaN        NaN         HR    Manglore
4            5  Bindu  40.0  1200000.0        NaN       Kopla
5            6  Bindu  40.0    20000.0         EC       Kopla

In [71]:
df.isnull().sum()

employee_id    0
name           0
age            1
salary         1
department     1
city           0
dtype: int64

In [73]:
df["age"] = df["age"].fillna(df["age"].mean())

In [75]:
df["salary"] = df["salary"].fillna(df["salary"].median())

In [77]:
df["department"]= df["department"].fillna(df["department"].mode()[0])

In [79]:
print("Removed missing values at age, salary, department")
print(df)

Removed missing values at age, salary, department
   employee_id   name   age     salary department        city
0            1   Amit  30.0    45000.0         IT      Mysuru
1            2  Surya  20.0    43000.0         HR   Bangaluru
2            3  Surya  23.0    15000.0         IT  Bhadravati
3            4  Navya  30.6    43000.0         HR    Manglore
4            5  Bindu  40.0  1200000.0         HR       Kopla
5            6  Bindu  40.0    20000.0         EC       Kopla

In [81]:
df["age"]=df["age"].astype(int)

In [83]:
df["salary"]=df["salary"].astype(int)

In [85]:
print(df)

   employee_id   name  age   salary department        city
0            1   Amit   30    45000         IT      Mysuru
1            2  Surya   20    43000         HR   Bangaluru
2            3  Surya   23    15000         IT  Bhadravati
3            4  Navya   30    43000         HR    Manglore
4            5  Bindu   40  1200000         HR       Kopla
5            6  Bindu   40    20000         EC       Kopla

In [89]:
df["salary_per_year"] = df["salary"] * 12

In [91]:
print(df)

   employee_id   name  age   salary department        city  salary_per_year
0            1   Amit   30    45000         IT      Mysuru           540000
1            2  Surya   20    43000         HR   Bangaluru           516000
2            3  Surya   23    15000         IT  Bhadravati           180000
3            4  Navya   30    43000         HR    Manglore           516000
4            5  Bindu   40  1200000         HR       Kopla         14400000
5            6  Bindu   40    20000         EC       Kopla           240000

In [97]:
df["city"] = df["city"].replace({
    "Bangaluru": "Bangalore",
    "Manglore": "Mangalore",
    "Kopla": "Koppal"
})

In [99]:
print(df)

   employee_id   name  age   salary department        city  salary_per_year
0            1   Amit   30    45000         IT      Mysuru           540000
1            2  Surya   20    43000         HR   Bangalore           516000
2            3  Surya   23    15000         IT  Bhadravati           180000
3            4  Navya   30    43000         HR   Mangalore           516000
4            5  Bindu   40  1200000         HR      Koppal         14400000
5            6  Bindu   40    20000         EC      Koppal           240000

In [103]:
df.duplicated().sum()

0